---
kind: method
id: M:Autodesk.Revit.DB.PanelTypeSet.Clear
source: html/4f37536f-1dd1-9588-9d7d-b9fdc1e68ba2.htm
---
# Autodesk.Revit.DB.PanelTypeSet.Clear Method

Removes every panel type from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```